<a href="https://colab.research.google.com/github/dariusg21-cyber/CREATE-USER-ROLE/blob/main/Copy_of_SQL_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![DSL_logo](https://raw.githubusercontent.com/BrockDSL/SQL-Workshop/main/dsl_logo.png)


# SQL and Databases

During this workshop we'll learn how to interact with SQL databases. Our focus will be on pulling information from different tables and constructing queries.

# Before we Begin!

1. Please click the 'Copy to Drive' button in the toolbar above
1. Click on the Gear icon next to your picture, Select 'Editor' and make sure 'Show Line Numbers' is selected
1. Share in the chat box a quick hello and where you are in the world right now.

In [1]:
#Libraries
#We'll use Pandas to interact with the SQL file

import sqlite3
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import FileLink, display

print("Done loading Library")

Done loading Library

## What's a Database?

The digram above represents how we can conceptualize a database as a series of _tables_ that reference each other. You can think of a _table_ as a very specific spreadsheet. We are going to be looking at a popular database used for teaching SQL that is called [NorthWind](https://docs.yugabyte.com/preview/sample-data/northwind/).

We are going to use a type of SQL connection/file called [SQLite](https://www.sqlite.org/index.html). This loads the SQL database into our environment and we can interact with it directly. Often we use mySQL which requires a connection to an SQL server. We use an environment like when we have lots of data to sort through.

Run the next cell to download and connect to that Database.

![ERD_Diagram](https://github.com/BrockDSL/SQL-Workshop/blob/main/Northwind_ERD.png?raw=true)

In [2]:
#Load SQLite File
!wget -O northwind.db "https://github.com/BrockDSL/SQL-Workshop/blob/main/northwind.db?raw=true"
try:
    connection = sqlite3.connect("northwind.db")
    print("Connection Successful!")
except:
    print("Error connecting to the database")

--2023-06-01 14:21:16--  https://github.com/BrockDSL/SQL-Workshop/blob/main/northwind.db?raw=true
Resolving github.com (github.com)... 140.82.112.4
Connecting to github.com (github.com)|140.82.112.4|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://github.com/BrockDSL/SQL-Workshop/raw/main/northwind.db [following]
--2023-06-01 14:21:16--  https://github.com/BrockDSL/SQL-Workshop/raw/main/northwind.db
Reusing existing connection to github.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/BrockDSL/SQL-Workshop/main/northwind.db [following]
--2023-06-01 14:21:16--  https://raw.githubusercontent.com/BrockDSL/SQL-Workshop/main/northwind.db
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 602112 (588K) [application/octet-stream]
Saving to: ‘northwind.db’

northwind.db        100%[===================>] 588.00K  --.-KB/s    in 0.03s

2023-06-01 14:21:17 (20.6 MB/s) - ‘northwind.db’ saved [602112/602112]

Connection Successful!

## Talking to the Database

We use a special kind of syntax to access the information that is in the database. We call this an _sql query_. It is very much structured like a sentence.

### Show Tables

Our first query will be to show all the tables in our database. Using the following:

```SQL
SELECT name FROM sqlite_master WHERE type='table';
```

In [3]:
QUERY = \
"""

SELECT name FROM sqlite_master WHERE type='table'

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

                    name
0             Categories
1        sqlite_sequence
2   CustomerCustomerDemo
3   CustomerDemographics
4              Customers
5              Employees
6    EmployeeTerritories
7          Order Details
8                 Orders
9               Products
10               Regions
11              Shippers
12             Suppliers
13           Territories

### Show All Customers and Details

We use the wildcard `*` to match any colum from the data.

```SQL

SELECT * FROM Customers;

```

In [4]:
QUERY = \
"""

SELECT * FROM Customers;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,Western Europe,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,Central America,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,Central America,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,British Isles,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,Northern Europe,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
88,WARTH,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,Scandinavia,90110,Finland,981-443655,981-443655
89,WELLI,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,South America,08737-363,Brazil,(14) 555-8122,None
90,WHITC,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,North America,98128,USA,(206) 555-4112,(206) 555-4115
91,WILMK,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,Scandinavia,21240,Finland,90-224 8858,90-224 8858
92,WOLZA,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,Eastern Europe,01-012,Poland,(26) 642-7012,(26) 642-7012

### Show certain information about Customers

We can name columns specifically if we want to only select those. See how this example is different than the previous.

```SQL

SELECT ContactName, Phone FROM Customers;

```

In [5]:
QUERY = \
"""

SELECT ContactName, Phone FROM Customers;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

                ContactName           Phone
0              Maria Anders     030-0074321
1              Ana Trujillo    (5) 555-4729
2            Antonio Moreno    (5) 555-3932
3              Thomas Hardy  (171) 555-7788
4        Christina Berglund   0921-12 34 65
..                      ...             ...
88         Pirkko Koskitalo      981-443655
89            Paula Parente   (14) 555-8122
90           Karl Jablonski  (206) 555-4112
91          Matti Karttunen     90-224 8858
92  Zbyszek Piestrzeniewicz   (26) 642-7012

[93 rows x 2 columns]

### Selecting and Ordering

We can order by any of the fields that we select.

```SQL
SELECT ContactName, Country FROM Customers ORDER BY Country;

```

In [6]:
QUERY = \
"""

SELECT ContactName, Country FROM Customers ORDER BY Country;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

         ContactName    Country
0               Val2       None
1         Valon Hoti       None
2   Patricio Simpson  Argentina
3     Yvonne Moncada  Argentina
4   Sergio Gutiérrez  Argentina
..               ...        ...
88    Karl Jablonski        USA
89    Manuel Pereira  Venezuela
90  Carlos Hernández  Venezuela
91   Carlos González  Venezuela
92  Felipe Izquierdo  Venezuela

[93 rows x 2 columns]

### Selecting and Comparing Values

We can test to see if something is `>`, `>=`, `<`, `<=`, or `=` as in the following.

```SQL
SELECT * from Orders WHERE Freight > 50;

```

In [7]:
QUERY = \
"""

SELECT * from Orders WHERE Freight > 50;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
1,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium
2,10253,HANAR,3,2016-07-10,2016-07-24,2016-07-16,2,58.17,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10255,RICSU,9,2016-07-12,2016-08-09,2016-07-15,3,148.33,Richter Supermarkt,Starenweg 5,Genève,Western Europe,1204,Switzerland
4,10257,HILAA,4,2016-07-16,2016-08-13,2016-07-22,3,81.91,HILARION-Abastos,Carrera 22 con Ave. Carlos Soublette #8-35,San Cristóbal,South America,5022,Venezuela
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,11059,RICAR,2,2018-04-29,2018-06-10,None,2,85.80,Ricardo Adocicados,"Av. Copacabana, 267",Rio de Janeiro,South America,02389-890,Brazil
356,11063,HUNGO,3,2018-04-30,2018-05-28,2018-05-06,2,81.73,Hungry Owl All-Night Grocers,8 Johnstown Road,Cork,British Isles,None,Ireland
357,11068,QUEEN,8,2018-05-04,2018-06-01,None,2,81.75,Queen Cozinha,"Alameda dos Canàrios, 891",Sao Paulo,South America,05487-020,Brazil
358,11070,LEHMS,2,2018-05-05,2018-06-02,None,1,136.00,Lehmanns Marktstand,Magazinweg 7,Frankfurt a.M.,Western Europe,60528,Germany
359,11072,ERNSH,4,2018-05-05,2018-06-02,None,2,258.64,Ernst Handel,Kirchgasse 6,Graz,Western Europe,8010,Austria

### Some Tables for Questions

Run the following cells to display some tables to the screen that will help you answer Q1 - Q3. Share in the chat-box when you have completed those questions.

In [ ]:
QUERY = \
"""

SELECT * FROM Products;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
QUERY = \
"""

SELECT * FROM Suppliers;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q1

Write an SQL query to select all _Products_ that have a _UnitPrice_ greater than 10. (Part of the query is written in for you already.)

In [8]:
QUERY = \
"""

SELECT * FROM products WHERE UnitPrice > 10;


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
3,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1
4,6,Grandma's Boysenberry Spread,3,2,12 - 8 oz jars,25.00,120,0,25,0
...,...,...,...,...,...,...,...,...,...,...
58,71,Flotemysost,15,4,10 - 500 g pkgs.,21.50,26,0,0,0
59,72,Mozzarella di Giovanni,14,4,24 - 200 g pkgs.,34.80,14,0,0,0
60,73,Röd Kaviar,17,8,24 - 150 g jars,15.00,101,0,5,0
61,76,Lakkalikööri,23,1,500 ml,18.00,57,0,20,0
62,77,Original Frankfurter grüne Soße,12,2,12 boxes,13.00,32,0,15,0

### Q2


Write an SQL query to select _Company Name_ and _Country_ from the _Suppliers_ table and order the results by Country. (Part of the query is written in for you already.)

In [9]:
QUERY = \
"""

SELECT companyName, country FROM Suppliers ORDER BY country;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

                               CompanyName      Country
0                            Pavlova, Ltd.    Australia
1                              G'day, Mate    Australia
2                Refrescos Americanas LTDA       Brazil
3                                Ma Maison       Canada
4                         Forêts d'érables       Canada
5                               Lyngbysild      Denmark
6                                Karkki Oy      Finland
7               Aux joyeux ecclésiastiques       France
8                       Escargots Nouveaux       France
9                             Gai pâturage       France
10             Heli Süßwaren GmbH & Co. KG      Germany
11       Plutzer Lebensmittelgroßmärkte AG      Germany
12  Nord-Ost-Fisch Handelsgesellschaft mbH      Germany
13                 Formaggi Fortini s.r.l.        Italy
14                    Pasta Buttini s.r.l.        Italy
15                           Tokyo Traders        Japan
16                                Mayumi's        Japan
17                     Zaanse Snoepfabriek  Netherlands
18                         Norske Meierier       Norway
19                            Leka Trading    Singapore
20      Cooperativa de Quesos 'Las Cabras'        Spain
21                       Svensk Sjöföda AB       Sweden
22                        PB Knäckebröd AB      Sweden
23                          Exotic Liquids           UK
24                Specialty Biscuits, Ltd.           UK
25              New Orleans Cajun Delights          USA
26               Grandma Kelly's Homestead          USA
27                       Bigfoot Breweries          USA
28             New England Seafood Cannery          USA

### Q3

Write an SQL query to show you _ProductName_ and _UnitPrice_ for any item that has more than 20 units in stock.Write an SQL query to (Part of the query is written in for you already.)

In [16]:
QUERY = \
"""

SELECT ProductName, UnitPrice FROM Products WHERE unitsinstock > 20;


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

                         ProductName  UnitPrice
0                               Chai      18.00
1       Chef Anton's Cajun Seasoning      22.00
2       Grandma's Boysenberry Spread      25.00
3                    Mishi Kobe Niku      97.00
4                              Ikura      31.00
5                     Queso Cabrales      21.00
6          Queso Manchego La Pastora      38.00
7                              Konbu       6.00
8                               Tofu      23.25
9                       Genen Shouyu      15.50
10                           Pavlova      17.45
11                  Carnarvon Tigers      62.50
12        Teatime Chocolate Biscuits       9.20
13            Sir Rodney's Marmalade      81.00
14               Gustaf's Knäckebröd      21.00
15                          Tunnbröd       9.00
16           NuNuCa Nuß-Nougat-Creme      14.00
17                Schoggi Schokolade      43.90
18                 Rössle Sauerkraut      45.60
19                           Geitost       2.50
20                     Sasquatch Ale      14.00
21                       Inlagd Sill      19.00
22                  Chartreuse verte      18.00
23                  Boston Crab Meat      18.40
24   Jack's New England Clam Chowder       9.65
25     Singaporean Hokkien Fried Mee      14.00
26                      Gula Malacca      19.45
27                         Spegesild      12.00
28                     Zaanse koeken       9.50
29                  Valkoinen suklaa      16.25
30                          Filo Mix       7.00
31                         Tourtière       7.45
32                      Pâté chinois      24.00
33            Gnocchi di nonna Alice      38.00
34                    Ravioli Angelo      19.50
35            Escargots de Bourgogne      13.25
36              Raclette Courdavault      55.00
37                    Sirop d'érable      28.50
38                      Vegie-spread      43.90
39         Wimmers gute Semmelknödel      33.25
40  Louisiana Fiery Hot Pepper Sauce      21.05
41         Laughing Lumberjack Lager      14.00
42                  Gudbrandsdalsost      36.00
43                       Flotemysost      21.50
44                        Röd Kaviar      15.00
45              Rhönbräu Klosterbier       7.75
46                      Lakkalikööri      18.00
47   Original Frankfurter grüne Soße      13.00

## Aggregate Functions

We can peform some basic math with our select statements using aggregate Functions

```
MIN
MAX
AVG
SUM
COUNT
```

----

### AVG

What is the average price of all of the products that this company sells?

```SQL

Select AVG(UnitPrice) from Products;

```

In [17]:
QUERY = \
"""

Select AVG(UnitPrice) from Products;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

   AVG(UnitPrice)
0       28.866364

### COUNT

How many employees does this company have?

```SQL

SELECT COUNT(EmployeeID) From Employees;

```

In [ ]:
QUERY = \
"""

SELECT COUNT(EmployeeID) From Employees;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
QUERY = \
"""

SELECT * From Employees;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Some Tables for Questions

Run the following cell to display a table to the screen that will help you answer Q4 - Q6. Share in the chat-box when you have completed those questions.

In [ ]:
QUERY = \
"""

SELECT * FROM Products;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q4

What product has the most units in *stock*? How many units are in stock, and what is the product called?

In [ ]:
QUERY = \
"""

SELECT ProductName, MAX(UnitsInStocks) FROM Products;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q5

What product has the most units on *order*? How many units are on order, and what is that product called?

In [ ]:
QUERY = \
"""


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q6

What is the total (ie SUM) of all of the products that are in stock and are in category 2.

In [ ]:
QUERY = \
"""

SELECT FROM Products WHERE ;


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

## Selecting from Multiple Databases

The real power in SQL is the ability to create queries that span multiple tables. This section of questions demonstrates how we can do it with **nested queries**

### Show Orders and include Customer Info

Show all the orders associated with Nancy Davolio


```SQL

SELECT * FROM Orders WHERE EmployeeID 

IN(SELECT EmployeeID FROM Employees WHERE FirstName = "Nancy");

```

In [ ]:
QUERY = \
"""

SELECT * FROM Orders WHERE EmployeeID 

IN(SELECT EmployeeID FROM Employees WHERE FirstName = "Nancy");


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
#Let's doublecheck

QUERY = \
"""

SELECT * FROM Employees;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Show all products that are beverages

```SQL

SELECT * FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Beverages");

```

In [ ]:
QUERY = \
"""

SELECT * FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Beverages");


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
#Let's doublecheck

QUERY = \
"""

SELECT * FROM Categories;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Show all products that are protiens

```SQL

SELECT * FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Meat/Poultry" OR CategoryName = "Seafood");

```

In [ ]:
QUERY = \
"""

SELECT * FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Meat/Poultry" OR CategoryName = "Seafood");

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
#Let's doublecheck

QUERY = \
"""

SELECT * FROM Categories;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Some Tables for Questions

Run the following cell to display a table to the screen that will help you answer Q7 - Q9. Share in the chat-box when you have completed those questions.

In [ ]:
QUERY = \
"""

SELECT * FROM Suppliers;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
QUERY = \
"""

SELECT * FROM Products;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q7

Write a query to display all of the products that come from the company called Exotic Liquids. (Part of the query is written for you.)

In [ ]:
QUERY = \
"""

SELECT * FROM Products WHERE SupplierID

IN(SELECT SupplierID FROM Suppliers WHERE CompanyName = "");


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q8

What categories of products does "Leka Trading" make? (Part of the query is written for you.)

In [ ]:
QUERY = \
"""

SELECT CategoryID FROM Products WHERE ProductID

IN(SELECT SupplierID FROM Suppliers WHERE CompanyName = "");

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q9



Write a query to display the names of the products that come from the company called "Bigfoot Breweries".

In [ ]:
QUERY = \
"""

SELECT ProductName FROM Products WHERE SupplierID

IN ();


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

## Basic Visualization Stuff

When we build a query against SQL in Pandas and then visualize our results by piping it into Matplotlib. Here we'll visualize who our 10 best customers are.

In [ ]:
QUERY = \
"""
SELECT 
    CustomerID, 
    COUNT(CustomerID) 
FROM 
    Orders 
GROUP BY 
    CustomerID 
    
ORDER BY 
    COUNT(CustomerID) DESC;

"""
try:
    #This next line limits our results to the top 10 rows of our results
    result = pd.read_sql_query(QUERY, connection)[0:10]
    display(result)
    plt.bar(result["CustomerID"],result["COUNT(CustomerID)"])
    plt.xticks(rotation = 45)
    plt.ylabel("Orders Placed")
    plt.xlabel("Customer")
    plt.show()
except:
    print("SQL is incorrect")

### One Last Question

Run the next query help you complete Q10. That is the last question of our workshop.

In [ ]:
QUERY = \
"""

SELECT 
    * 
FROM 
    Orders;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q10

See if you can complete the SQL query to make a bar graph to display a bar graph of the what employees have sold the most.

In [ ]:
QUERY = \
"""

SELECT 
    EmployeeID, 
    COUNT() 
FROM 
       
GROUP BY 
    EmployeeID;


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
    plt.bar(result["EmployeeID"],result["COUNT(EmployeeID)"])
    plt.title("Sales by Employee")
    plt.ylabel("Sales")
    plt.xlabel("Employee ID")
    plt.show()
except:
    print("SQL is incorrect")

## One last thing! Getting Results out of SQL

It is possible to take your SQL query and put it into something like a CSV file so that you can work with the data directly in something like Excel. The following cell demonstrates this.

In [ ]:
QUERY = \
"""

SELECT * FROM CUSTOMERS;

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    result.to_csv('SQL_output.csv',index=False)
    display(result)
    
except:
    print("SQL is incorrect")

## Downloading your file

Once you have made the SQL query that you want in the cell above, run this next cell to get a link to download your file.

In [ ]:
#If by chance you are working working in Anaconda 
#comment lines 5,6 uncomment 2
#FileLink('./SQL_output.csv')

from google.colab import files
files.download('SQL_output.csv')

## Congratulations!

Congratulations, you have successfully been introduced to SQL and how you can interact with it. It gets **very complex** quickly. There are lots of other places you can go with this.


### Further Reading

- [Databases and SQL](https://swcarpentry.github.io/sql-novice-survey/) Software Carpentries material on how to interact with a database

- [mySQL with R](https://programminghistorian.org/en/lessons/getting-started-with-mysql-using-r) Tutorial from Programming Historian on how to use R to interact with SQL

- [Kaggle's SQL Tutorials](https://www.kaggle.com/learn/intro-to-sql) Series of notebooks from Kaggle on how to use SQL for big data.




To sign-up for future sessions please check us out on [Eventbrite](https://brockdsl.eventbrite.com)

Check us out online at our homepage: [https://brockdsl.github.io](https://brockdsl.github.io)

## Homework!

If you want more of a challenge try the questions below. They combine the use of aggregate functions as well as nested queries.

### What is the average price of Beverages?

```SQL

SELECT AVG(UnitPrice) FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Beverages");

```

In [ ]:
QUERY = \
"""

SELECT AVG(UnitPrice) FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Beverages");

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### How many products are Proteins?

```SQL


SELECT COUNT(*) FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Meat/Poultry" OR CategoryName = "Seafood");


```

In [ ]:
QUERY = \
"""

SELECT COUNT(*) FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "Meat/Poultry" OR CategoryName = "Seafood");


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### What is the maximum weight of an order shipped by Speedy Express?

```SQL

SELECT MAX(Freight) FROM Orders WHERE ShipVia

IN(SELECT ShipperID FROM Shippers WHERE CompanyName = "Speedy Express");


```

In [ ]:
QUERY = \
"""

SELECT MAX(Freight) FROM Orders WHERE ShipVia

IN(SELECT ShipperID FROM Shippers WHERE CompanyName = "Speedy Express");


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Some Tables for Questions

Run the following cell to display a table to the screen that will help you answer Q11 - Q13. Share in the chat-box when you have completed those questions.

In [ ]:
QUERY = \
"""

Select * FROM Employees;


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

In [ ]:
QUERY = \
"""

Select * FROM Products;


"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q11

What is the total number of orders associated with employeers who have _TitleOfCourtesy_ of **Mr.**. (Part of the query is written for you.)

In [ ]:
QUERY = \
"""

SELECT COUNT(OrderId) FROM ***** WHERE EmployeeID

IN(SELECT EmployeeID FROM Employees WHERE TitleOfCourtesy = "");

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q12

What is the total number of orders associated with employeers who have _TitleOfCourtesy_ of **Mrs.** OR **Ms**. (Part of the query is written for you.)

In [ ]:
QUERY = \
"""

SELECT COUNT(OrderId) FROM Orders WHERE EmployeeID

IN(SELECT **** FROM Employees WHERE TitleOfCourtesy = "" OR TitleOfCourtesy = "");



"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")

### Q13

How many units are in stock for all items in the Confections and Condiments category? (Part of the query is written for you.)

In [ ]:
QUERY = \
"""

SELECT SUM() FROM Products WHERE CategoryID

IN(SELECT CategoryID FROM Categories WHERE CategoryName = "" OR CategoryName = "")

"""
try:
    result = pd.read_sql_query(QUERY, connection)
    display(result)
except:
    print("SQL is incorrect")